Day1/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Day1/src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура Команда1НаСервере()

КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

// Товары цена при изменении.
// 
// Параметры:
//  Элемент - ПолеФормы - Элемент
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	Текущиеданные = Элементы.Товары.ТекущиеДанные;

	Если Текущиеданные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Текст = "Поменялась цена";

	РассчитатьСуммуВСтроке(Текущиеданные, Текст);
	
КонецПроцедуры


// Пересчитывает сумму строки табличной части при изменении количества товара
//
// Параметры:
//   Элемент - ПолеФормы - элемент формы, для которого вызвано событие
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	Текущиеданные = Элементы.Товары.ТекущиеДанные;

	Если Текущиеданные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекстСообщения = "Поменялось количество";

	РассчитатьСуммуВСтроке(Текущиеданные, ТекстСообщения);

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуВСтроке(Строка, ТекстПользователю)
	
	Строка.Сумма = Строка.Количество * Строка.Цена * 0.9;
	//Сообщить(ТекстПользователю);
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (ТекстПользователю);
	Сообщение.Сообщить();
	
	Сотрудник = ОписаниеПользователя();
	//Сообщить(Сотрудник.Имя);
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (Сотрудник.Имя);
	Сообщение.Сообщить();
		
КонецПроцедуры

// Описание пользователя.
// 
// Возвращаемое значение:
//  Структура - Описание пользователя:
// * Имя - Строка - 
// * Стаж - Число - 
// * ДатаПриема - Дата - 
// * Штатный - Булево - 
&НаКлиенте
Функция ОписаниеПользователя()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("Стаж", 15);
	//@skip-check use-non-recommended-method
	Человек.Вставить("ДатаПриема", ТекущаяДата());
	Человек.Вставить("Штатный", Истина);

	Возврат Человек;

КонецФункции
